:PROPERTIES:
:ID:       D87B9E33-CA56-4301-A59A-6FC951966D08
:header-args: :results output
:END:
#+title: ollama

Ollama provides support for running some models (LLM/foundational) locally.

* Installation

#+begin_src shell
  ollama --version
#+end_src

#+RESULTS:
: ollama version is 0.24.0

* Help

#+begin_src shell
  ollama --help
#+end_src

#+RESULTS:
#+begin_example
Large language model runner

Usage:
  ollama [flags]
  ollama [command]

Available Commands:
  serve       Start Ollama
  create      Create a model
  show        Show information for a model
  run         Run a model
  stop        Stop a running model
  pull        Pull a model from a registry
  push        Push a model to a registry
  signin      Sign in to ollama.com
  signout     Sign out from ollama.com
  list        List models
  ps          List running models
  cp          Copy a model
  rm          Remove a model
  launch      Launch the Ollama menu or an integration
  help        Help about any command

Flags:
  -h, --help         help for ollama
      --nowordwrap   Don't wrap words to the next line automatically
      --verbose      Show timings for response
  -v, --version      Show version information

Use "ollama [command] --help" for more information about a command.
#+end_example

* List

Ollama supports listing installed models - support for querying
available models should be built out using something like curl.

This list therefore reflects what I currently have on one my workstations.

#+begin_src shell
  ollama list
#+end_src

#+RESULTS:
: NAME                       ID              SIZE      MODIFIED    
: nomic-embed-text:latest    0a109f422b47    274 MB    2 weeks ago    
: qwen3:latest               500a1f067a9f    5.2 GB    2 weeks ago    
: gpt-oss:latest             17052f91a42e    13 GB     4 weeks ago    
